---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyDouble
source: html/4246af88-6df7-7ced-a693-1e66ef2bb344.htm
---
# AssetPropertyDouble Methods

Adds a new connected asset attached to this asset property, if it allows it.